//链接mongoose数据库
const mongoose = require('mongoose')
mongoose.connect('mongodb+srv://3253975221_db_user:HJLhjl3629692@cluster0.5ukg2ui.mongodb.net/db_blog', {
  useUnifiedTopology: true,
  useNewUrlParser: true
})
let db = mongoose.connection
db.on('error', function (err) {
  console.log(err)
})
db.on('open', function (err) {
  console.log('      ███╗   ███╗ ██████╗ ███╗   ██╗ ██████╗  ██████╗       ')
  console.log('      ████╗ ████║██╔═══██╗████╗  ██║██╔════╝ ██╔═══██╗      ')
  console.log('█████╗██╔████╔██║██║   ██║██╔██╗ ██║██║  ███╗██║   ██║█████╗')
  console.log('╚════╝██║╚██╔╝██║██║   ██║██║╚██╗██║██║   ██║██║   ██║╚════╝')
  console.log('      ██║ ╚═╝ ██║╚██████╔╝██║ ╚████║╚██████╔╝╚██████╔╝    ')
  console.log('      ╚═╝     ╚═╝ ╚═════╝ ╚═╝  ╚═══╝ ╚═════╝  ╚═════╝ ')                                                   
})

module.exports = {
  mongoose
}